Product-Display/stresstest.yml
config:
    target: 'http://localhost:3002'
    phases:
      - duration: 60
        arrivalRate: 400
    defaults:
      headers:
        x-my-service-auth: '987401838271002188298567'
    payload:
        path: "ids.csv"
        fields: 
            - "skuid"

scenarios:
    - flow:
      - get:
          url: "/product/sku/{{skuid}}"